cases/Level1_Longitudinal/constant/physicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

viscosityModel  constant;

rho             [1 -3 0 0 0 0 0] 1.18;

nu              [0 2 -1 0 0 0 0] 1.5e-05;
