cases/Level1_Longitudinal/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0       0       0)
    (0.15    0       0)
    (0.15    0.003   0)
    (0       0.003   0)

    (0       0       0.001)
    (0.15    0       0.001)
    (0.15    0.003   0.001)
    (0       0.003   0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (300 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
