cases/Level1_Longitudinal/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          incompressibleFluid;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         2;

deltaT          0.0001;

writeControl    timeStep;
writeInterval   500;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.0005;

functions
{
    scalarTransportT
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");

        field           T;

        diffusivity     constant;
        D               2.2e-05;

        executeControl  timeStep;
        executeInterval 1;

        writeControl    writeTime;
        writeInterval   1;
    }
}