cases/Level1_Longitudinal/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-2;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor           yes;
    nOuterCorrectors            1;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;
}

relaxationFactors
{
}

cache
{
    grad(U);
}
